_site/2014-05-09-svn-switch-and-merge.html


<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <title>SVN switch and merge</title>
    
    <meta name="author" content="Kimi MA">

    <!-- Enable responsive viewport -->
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <!-- Le HTML5 shim, for IE6-8 support of HTML elements -->
    <!--[if lt IE 9]>
    <![endif]-->

    <!-- Le styles -->
    <link href="assets/themes/twitter/bootstrap/css/bootstrap.2.2.2.min.css" rel="stylesheet">
    <link href="assets/themes/twitter/css/style.css?body=1" rel="stylesheet" type="text/css" media="all">
    <link rel="shortcut icon" type="image/ico" href="/assets/favicon.ico">
    <!-- Le fav and touch icons -->
  <!-- Update these with your own images
    <link rel="shortcut icon" href="images/favicon.ico">
    <link rel="apple-touch-icon" href="images/apple-touch-icon.png">
    <link rel="apple-touch-icon" sizes="72x72" href="images/apple-touch-icon-72x72.png">
    <link rel="apple-touch-icon" sizes="114x114" href="images/apple-touch-icon-114x114.png">
  -->

    <!-- atom & rss feed -->
    <link href="/atom.xml" type="application/atom+xml" rel="alternate" title="Sitewide ATOM Feed">
    <link href="/rss.xml" type="application/rss+xml" rel="alternate" title="Sitewide RSS Feed">

  </head>

  <body>
    <div class="navbar navbar-fixed-top">
      <div class="navbar-inner">
        <div class="container-narrow">
          <a class="brand" href="/">Die Welt ist meine Vorstellung</a>
          <ul class="nav">
            
            
            


  
    
      
    
  
    
      
      	
      	<li><a href="/archive">Archive</a></li>
      	
      
    
  
    
      
    
  
    
      
      	
      	<li><a href="/categories">Topics</a></li>
      	
      
    
  
    
      
    
  
    
      
    
  
    
      
    
  
    
      
    
  
    
      
      	
      	<li><a href="/tags">Tags</a></li>
      	
      
    
  



          </ul>
        </div>
      </div>
    </div>

    <div class="container-narrow">

      <div class="content">
        

<div class="page-header">
  <h1>SVN switch and merge </h1>
</div>

<div class="row-fluid post-full">
  <div class="span12">
    <div class="date">
      <span>09 May 2014</span>
    </div>
    <div class="content">
      <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>In this article, I'll introduce following svn command:
<ul class="org-ul">
<li>svn switch
</li>
<li>svn log
</li>
<li>svn merge
</li>
</ul>
</li>
<li>and finally combines these command into one svn workflow.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Usage of svn command</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> svn log</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>list svn logs
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">kimim@kimi.im codedojo$<span style="color: #0000ff; font-style: italic;">svn</span> log -l 5 -g
------------------------------------------------------------------------
r595 | kimim | 2014-04-29 11:11:22 +0800 (Tue, 29 Apr 2014) | 6 lines

merge from my branch

------------------------------------------------------------------------
r594 | kimim | 2014-04-29 10:50:27 +0800 (Tue, 29 Apr 2014) | 2 lines
Merged via: r595

add handles
</pre>
</div>
<ul class="org-ul">
<li>more info: svn help log
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> svn switch</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>switch current folder to a branch
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">kimim@kimi.im codedojo$<span style="color: #0000ff; font-style: italic;">svn</span> sw ^/branches/codedojo
U    Makefile
U    jekyll.el
 U   .
Updated to revision 595.
</pre>
</div>
<ul class="org-ul">
<li>more info: "svn help switch"
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> svn merge</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>merge from one branch to another
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">kimim@kimi.im codedojo$<span style="color: #0000ff; font-style: italic;">svn</span> merge ^/trunk/codedojo
--- Merging differences between repository URLs into <span style="color: #3a5fcd;">'.'</span>:
U    jekyll.el
U    ox-reveal.el
--- Recording mergeinfo for merge between repository URLs into <span style="color: #3a5fcd;">'.'</span>:
 U   .
</pre>
</div>
<ul class="org-ul">
<li>more info: "svn help merge"
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> SVN graph of merge operation</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-text">    branches/codedojo  +-----------------------------+-------+-----------&gt;
                      /                             /         \
                     /                             (merge)    (merge)
                    /       r598                  /             \
trunk ------+------+----------o------------------+---------------+-------&gt;
             \                 \                /
              \                 \_(merge)___   (merge)
               \                            \ /
branches/code2  +----------------------------+---------------------------&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> SVN workflow</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Create a branch of sub-folder</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-sh">kimim@kimi.im codedojo$<span style="color: #0000ff; font-style: italic;">svn</span> copy ^/trunk/codedojo ^/branches/codedojo

Committed revision 598.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Switch the sub-folder to the branch</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>switch to branch
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">kimim@kimi.im codedojo$<span style="color: #0000ff; font-style: italic;">svn</span> switch ^/branches/codedojo
U    Makefile
U    jekyll.el
 U   .
</pre>
</div>
<ul class="org-ul">
<li>branch info: <code>^/branches/codedojo</code>
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">kimim@kimi.im codedojo$<span style="color: #0000ff; font-style: italic;">svn</span> info
Path: .
Working Copy Root Path: /home/kimim/codedojo
URL: http://kimi.im/svn/lily/branches/codedojo
Relative URL: ^/branches/codedojo
Repository Root: http://kimi.im/svn/lily
Repository UUID: 740ae2fa-c468-104b-b514-ad5a56475b1e
Revision: 598
Node Kind: directory
Schedule: normal
Last Changed Author: kimim
Last Changed Rev: 598
Last Changed Date: 2014-04-29 16:00:35 +0800 (Tue, 29 Apr 2014)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Commit the daily modification to the branch</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>commit code as soon as you need
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">kimim@kimi.im codedojo$<span style="color: #0000ff; font-style: italic;">svn</span> ci
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Merge trunk changes to branch, compile and test</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">

<pre class="src src-sh">kimim@kimi.im codedojo$<span style="color: #0000ff; font-style: italic;">svn</span> merge ^/trunk/codedojo
--- Recording mergeinfo for merge of r598 into <span style="color: #3a5fcd;">'.'</span>:
 U   .
</pre>
</div>
<ul class="org-ul">
<li>after you merged <b>trunk</b> to your branch, you'd better to compile and test with the branch
</li>
<li>if any error, fix and commit, remember to commit the fix to the branch
</li>
<li>when all the test passed, you will need to merge the code back to trunk
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Merge back the branch to trunk, compile and test</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>switch to trunk
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">kimim@kimi.im codedojo$<span style="color: #0000ff; font-style: italic;">svn</span> switch ^/trunk/codedojo
At revision 598.
</pre>
</div>
<ul class="org-ul">
<li>merge branch to trunk
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">kimim@kimi.im codedojo$<span style="color: #0000ff; font-style: italic;">svn</span> merge ^/branches/codedojo
--- Recording mergeinfo for merge of r598 into <span style="color: #3a5fcd;">'.'</span>:
 G   .
</pre>
</div>
<ul class="org-ul">
<li>finally, you need to test the merged trunk and commit the changes merged from branch to trunk
</li>
<li>be reminded that the branch already contains the code merged from trunk
</li>
</ul>
</div>
</div>
</div>

    </div>

  
    <ul class="tag_box inline">
      <li><i class="icon-folder-open"></i></li>
      
      


  
     
    	<li><a href="/categories.html#productivity-ref">
    		productivity <span>21</span>
    	</a></li>
    
  


    </ul>
    

  
    <ul class="tag_box inline">
      <li><i class="icon-tags"></i></li>
      
      


  
     
    	<li><a href="/tags.html#subversion-ref">subversion <span>1</span></a></li>
    
  



    </ul>
    

    <hr>
    <div class="pagination">
      <ul>
      
        <li class="prev"><a href="/2014-05-06-technical-manager" title="How to Improve Technical Skill as a First Line Manager">&larr; Previous</a></li>
      
        <li><a href="/archive.html">Archive</a></li>
      
        <li class="next"><a href="/2014-05-17-drawing-uml-with-plantuml" title="Drawing UML with plantuml">Next &rarr;</a></li>
      
      </ul>
    </div>
    <hr>
    


  <!-- Duoshuo Comment BEGIN -->
	<div class="ds-thread"></div>
<script type="text/javascript">
var duoshuoQuery = {short_name:"kimim"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = 'http://static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0] 
		|| document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>
<!-- Duoshuo Comment END -->





  </div>
</div>


      </div>
      <hr>
      <footer>
        <p>&copy; 2018 Kimi MA,
           All right reserved.
        </p>
      </footer>

    </div>

    
  </body>
</html>

